In [1]:
#Vamos a cargar un objeto DataFrame directamente de un fichero
#en este caso un csv,si se tiene que coger la ruta de Windows los
#slash al reves
import pandas as pd
titanic=pd.read_csv("Titanic.csv")
titanic

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Pepe, Mr. Owen Harris",male,22,1,0,A/5 21171,"7,25",NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38,1,0,PC 17599,"71,2833",C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26,0,0,STON/O2. 3101282,"7,925",NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35,1,0,113803,"53,1",C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35,0,0,373450,"8,05",NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27,0,0,211536,13,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19,0,0,112053,30,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,"23,45",NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26,0,0,111369,30,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32,0,0,370376,"7,75",NaN,Q

In [2]:
titanic.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    object
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    object
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: int64(5), object(7)
memory usage: 83.7+ KB

In [3]:
#como ver los primeros 10 nombres de los pasajeros
titanic['Name'].head(10)

0                                Pepe, Mr. Owen Harris
1    Cumings, Mrs. John Bradley (Florence Briggs Th...
2                               Heikkinen, Miss. Laina
3         Futrelle, Mrs. Jacques Heath (Lily May Peel)
4                             Allen, Mr. William Henry
5                                     Moran, Mr. James
6                              McCarthy, Mr. Timothy J
7                       Palsson, Master. Gosta Leonard
8    Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)
9                  Nasser, Mrs. Nicholas (Adele Achem)
Name: Name, dtype: object

In [5]:
#practica ver las ultimas 20 edades
titanic['Age'].tail(20)

871     47
872     33
873     47
874     28
875     15
876     20
877     19
878    NaN
879     56
880     25
881     33
882     22
883     28
884     25
885     39
886     27
887     19
888    NaN
889     26
890     32
Name: Age, dtype: object

In [8]:
#aplicar un filtro al DataFrame, primero necesitaremos un objeto
#que almacene el filtro
ftitanicC2 = titanic['Pclass'] == 2
titanic[ftitanicC2].head(20)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
9,10,1,2,"Nasser, Mrs. Nicholas (Adele Achem)",female,14,1,0,237736,"30,0708",NaN,C
15,16,1,2,"Hewlett, Mrs. (Mary D Kingcome)",female,55,0,0,248706,16,NaN,S
17,18,1,2,"Williams, Mr. Charles Eugene",male,NaN,0,0,244373,13,NaN,S
20,21,0,2,"Fynney, Mr. Joseph J",male,35,0,0,239865,26,NaN,S
21,22,1,2,"Beesley, Mr. Lawrence",male,34,0,0,248698,13,D56,S
33,34,0,2,"Wheadon, Mr. Edward H",male,66,0,0,C.A. 24579,"10,5",NaN,S
41,42,0,2,"Turpin, Mrs. William John Robert (Dorothy Ann ...",female,27,1,0,11668,21,NaN,S
43,44,1,2,"Laroche, Miss. Simonne Marie Anne Andree",female,3,1,2,SC/Paris 2123,"41,5792",NaN,C
53,54,1,2,"Faunthorpe, Mrs. Lizzie (Elizabeth Anne Wilkin...",female,29,1,0,2926,26,NaN,S
56,57,1,2,"Rugg, Miss. Emily",female,21,0,0,C.A. 31026,"10,5",NaN,S
58,59,1,2,"West, Miss. Constance Mirium",female,5,1,2,C.A. 34651,"27,75",NaN,S
66,67,1,2,"Nye, Mrs. (Elizabeth Ramell)",female,29,0,0,C.A. 29395,"10,5",F33,S
70,71,0,2,"Jenkin, Mr. Stephen Curnow",male,32,0,0,C.A. 33111,"10,5",NaN,S
72,73,0,2,"Hood, Mr. Ambrose Jr",male,21,0,0,S.O.C. 14879,"73,5",NaN,S
78,79,1,2,"Caldwell, Master. Alden Gates",male,"0,83",0,2,248738,29,NaN,S
84,85,1,2,"Ilett, Miss. Bertha",female,17,0,0,SO/C 14885,"10,5",NaN,S
98,99,1,2,"Doling, Mrs. John T (Ada Julia Bone)",female,34,0,1,231919,23,NaN,S
99,100,0,2,"Kantor, Mr. Sinai",male,34,1,0,244367,26,NaN,S
117,118,0,2,"Turpin, Mr. William John Robert",male,29,1,0,11668,21,NaN,S
120,121,0,2,"Hickman, Mr. Stanley George",male,21,2,0,S.O.C. 14879,"73,5",NaN,S

In [13]:
#practica averiguar el numero de pasajeros que viajaba en clase 3
#practica averiguar el numero de pasajeros que eran mujeres(female)
ftitanicC3 = titanic['Pclass'] == 3
valor=titanic[ftitanicC3].Pclass.count()
print("El numero de pasajeros de la clase 3 era  " + str(valor))

El numero de pasajeros de la clase 3 era  491

In [14]:
ftitanicFem = titanic['Sex'] == 'female'
valorf=titanic[ftitanicFem].Pclass.count()
print("El numero de pasajeros mujeres era " + str(valorf))

El numero de pasajeros mujeres era 314

In [15]:
#como filtrar por +1 condicion, hay 2 maneras
#si es el mismo campo o si son diferentes 
#si es el mismo campo utilizare el OR |
#si son campo (columna) diferente utilizare el OR o el AND &
ftitanicC3F = (titanic['Pclass'] == 3) & (titanic['Sex'] == 'female')
valor=titanic[ftitanicC3F].Pclass.count()
print("El numero de pasajeros de mujeres de la clase 3 era  " + str(valor))

El numero de pasajeros de mujeres de la clase 3 era  144

In [22]:
#paractica queremos saber cuantas personas de la clase 1, hombres
#sobrevivieron (Survived = 1) y un texto mejorado
ftitanicC1M = (titanic['Pclass'] == 1) & (titanic['Sex'] == 'male') & (titanic['Survived'] == 1)
valor=titanic[ftitanicC1M].Pclass.count()
print("El numero de pasajeros hombres de la clase 1 era  " + str(valor))

El numero de pasajeros hombres de la clase 1 era  45

In [26]:
#El pajero de menor edad que viajaba en el titanic
#El pasajero de mayor edad que viajaba en el titanic 
#el promedio de edad de las mujeres de la clase 1

ftitanicC1Fprom = (titanic['Pclass'] == 1) & (titanic['Sex'] == 'female')
valor=titanic[ftitanicC1Fprom].str(Age.mean())
print("El promedio  " + str(valor))

AttributeError: 'DataFrame' object has no attribute 'str'

In [32]:
#Primero con info ver si los campos tenen su tipo correspondiente
#object = string, int64 = Entero, float64 = Decimal
#titanic['Age'].sort_values(ascending =True)
#Voy a utilizar del objeto str la funcion replace
#titanic['Age'] = titanic['Age'].str.replace(",", ".").astype(float)
titanic['Age'].mean()

29.69911764705882

In [33]:
titanic['Age'].min()

0.42

In [34]:
titanic['Age'].max()

80.0

In [35]:
ftitanicC1Fprom = (titanic['Pclass'] == 1) & (titanic['Sex'] == 'female')
valor=titanic[ftitanicC1Fprom].Age.mean()
print("El promedio  " + str(valor))

El promedio  34.61176470588235

In [38]:
#vamos a ver la agrupacion en un dataframe, mediante la funcion 
#group by, el parentesis y despues el corchete dentro de los campor
#entre comillas, separados por comas 
#el numero de pasajeros por sexo y pclass 
titanic2 = titanic.groupby(['Sex', 'Pclass']).Pclass.count()
titanic2

Sex     Pclass
female  1          94
        2          76
        3         144
male    1         122
        2         108
        3         347
Name: Pclass, dtype: int64

In [40]:
#cantidad personas por embarque clase y genero en un nuevo dataframe llamado titanic 3
#promedio de edad agrupado por genero, clase y embarque de los pasajeros que no sobrevivieron 
titanic3 = titanic.groupby(['Sex', 'Pclass', 'Embarked']).Pclass.count()
titanic3

Sex     Pclass  Embarked
female  1       C            43
                Q             1
                S            48
        2       C             7
                Q             2
                S            67
        3       C            23
                Q            33
                S            88
male    1       C            42
                Q             1
                S            79
        2       C            10
                Q             1
                S            97
        3       C            43
                Q            39
                S           265
Name: Pclass, dtype: int64

In [49]:
titanicfiltered = titanic['Survived'] == 0
titanicfiltered
titanicns=titanic[titanicfiltered].groupby(['Sex', 'Pclass', 'Embarked']).Age.mean()
titanicns

Sex     Pclass  Embarked
female  1       C           50.000000
                S           13.500000
        2       S           36.000000
        3       C           20.700000
                Q           28.100000
                S           23.688889
male    1       C           43.050000
                Q           44.000000
                S           45.362500
        2       C           29.500000
                Q           57.000000
                S           33.414474
        3       C           27.555556
                Q           28.076923
                S           27.168478
Name: Age, dtype: float64

In [ ]:
#para hacer un analisis predictivo con regresion lineal, vamos a necesitar lo siguiente 
#libreria pandas, libreria numpyy, libreria matploblib, llibreria scikit-learn(el modelo predictivo)